/*
 * Оператор switch
 */

/*
? Напиши скрипт вибору опції доставки товара.
? Опція зберігається в змінній option: 1 - самовивіз, 2 - кур'єр, 3 - пошта
?
? В змінну message потрібно записати повідомлення в залежності від опції.
? - 'Ви можете забрати товар завтра з 12:00 в нашому офісі'
? - 'Кур'єр доставить замовлення завтра з 9:00 до 18:00'
? - 'Посилку буде відправлено сьогодні'
? - 'Вам передзвонить менеджер'
 */

// const option = 3;
// let message = '';

// switch (option) {
//   case 1: {
//     console.log('Ви можете забрати товар завтра з 12:00 в нашому офісі');

//     break;
//   }

//   case 2: {
//     console.log('Кур`єр доставить замовлення завтра з 9:00 до 18:00');

//     break;
//   }

//   case 3: {
//     console.log('Посилку буде відправлено сьогодні');

//     break;
//   }

//   default: {
//     console.log('Вам передзвонить менеджер');
//   }
// }
